
// 1.需求：打印九九乘法表
// // 1*1=1 
// // 1*2=2 2*2=4 
// // 1*3=3 2*3=6 3*3=9 
// // 1*4=4 2*4=8 3*4=12 4*4=16 
// // 1*5=5 2*5=10 3*5=15 4*5=20 5*5=25 
// // 1*6=6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36 
// // 1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49 
// // 1*8=8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64 
// // 1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81 
// // 1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81 
// // 1*8=8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64 
// // 1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49 
// // 1*6=6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36 
// // 1*5=5 2*5=10 3*5=15 4*5=20 5*5=25 
// // 1*4=4 2*4=8 3*4=12 4*4=16 
// // 1*3=3 2*3=6 3*3=9 
// // 1*2=2 2*2=4 
// // 1*1=1 
// 分析: 
// 外层控制行数  内层控制列数
// 九九乘法表一共9个数  1开始 一直到9
// 倒叙修改 i
// for (var i = 1; i <= 9; i++) {
//     var str = ''
//     for (var j = 1; j <= i; j++) {
//         str += i + '*' + j + '=' + i * j + ' ';
//     }
//     console.log(str)
// }
// for (var i = 9; i >= 1; i--) {
//     var str = ''
//     for (var j = 1; j <= i; j++) {
//         str += i + '*' + j + '=' + i * j + ' ';
//     }
//     console.log(str)
// }




// 2.打印闪电
// var str = ""
// for (var i = 0; i < 1; i++) {
//     str += "*";
// }
// console.log(str);

// var str = ""
// for (var i = 0; i < 2; i++) {
//     str += "*";
// }
// console.log(str);

// var str = ""
// for (var i = 0; i < 3; i++) {
//     str += "*";
// }
// console.log(str);

// var str = ""
// for (var i = 0; i < 7; i++) {
//     str += "*";
// }
// console.log(str);

// var str = ""
// for (var i = 0; i < 3; i++) {
//     str += "*";
// }
// console.log(' '+str);

// var str = ""
// for (var i = 0; i < 2; i++) {
//     str += "*";
// }
// console.log(' '+str);

// var str = ""
// for (var i = 0; i < 1; i++) {
//     str += "*";
// }
// console.log(' '+str);


// 3.打印下列图形
// var str='';
// for(var i=1;i<=9;i++){
//     str+='*'
// }
// console.log('    '+str)

// var str='';
// for(var i=1;i<=7;i++){
//     str+='*'
// }
// console.log('   '+str)

// var str='';
// for(var i=1;i<=5;i++){
//     str+='*'
// }
// console.log('  '+str)

// var str='';
// for(var i=1;i<=3;i++){
//     str+='*'
// }
// console.log(' '+str)

// var str='';
// for(var i=1;i<=1;i++){
//     str+='*'
// }
// console.log(''+str)


// 4.打印金字塔
// var str='';
// for(var i=1;i<=3;i++){
//     str+='-'
// }
// for(var i=1;i<=1;i++){
//     str+='*'
// }
// console.log(str)

// var str='';
// for(var i=1;i<=2;i++){
//     str+='-'
// }
// for(var i=1;i<=3;i++){
//     str+='*'
// }
// console.log(str)

// var str='';
// for(var i=1;i<=1;i++){
//     str+='-'
// }
// for(var i=1;i<=5;i++){
//     str+='*'
// }
// console.log(str)

// var str='';
// for(var i=1;i<=7;i++){
//     str+='*'
// }
// console.log(str)

// var str='';
// for(var i=1;i<=1;i++){
//     str+='-'
// }
// for(var i=1;i<=5;i++){
//     str+='*'
// }
// console.log(str)

// var str='';
// for(var i=1;i<=2;i++){
//     str+='-'
// }
// for(var i=1;i<=3;i++){
//     str+='*'
// }
// console.log(str)

// var str='';
// for(var i=1;i<=3;i++){
//     str+='-'
// }
// for(var i=1;i<=1;i++){
//     str+='*'
// }
// console.log(str)

// 5.5文钱可以买一只公鸡，3文钱可以买一只母鸡，1文钱可以买3只雏鸡。现在用100文钱买100只鸡，那么各有公鸡、母鸡、雏鸡多少只？
for (var i = 0; i < 100; i++) {
    if (i % 3 == 0) {
        for (var j = 0; j < (100 - i); j++) {
            if (i * 1 / 3 + j * 5 + (100 - i - j) * 3 == 100) {
                console.log("雏鸡"  + i + "只，公鸡"
                     + j + "只，母鸡" + (100 - i - j) + "只");
            }
        }
    }
}


//6.需求 ：有一个棋盘，有64个方格，在第一个方格里面放1粒芝麻重量是0.00001kg，第二个里面放2粒，第三个里面放4，求棋盘上放的所有芝麻的重量

// var kg;
// var sum = 1;
// for (var i = 1; i < 64; i++) {
//     sum *= 2;
// }
// kg = sum * 0.00001;
// console.log(kg)


// 7.大马驮2石粮食，中马驮1石粮食，两头小马驮一石粮食，要用100匹马，驮100石粮食，该如何调配？
// for (var i = 0; i <= 50; i++) {
//     //循环三次，分别是小中大马的数量
//     for (var a = 0; a <= 100; a++) {
//         for (var b = 0; b <= 100; b++) {
//             //判断，大马x2+中马(1)+小马/2的数量为100，且三种马的数量加起来等于100
//             if ((i * 2 + a + b / 2 == 100) && (i + a + b == 100)) {
//                 //输出结果
//                 console.log("大" + i + "中" + a + "小" + b);

//             }
//         }
//     }
// }



// 8.有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？有多少个，有哪些三位数？
// var sum=0;
// for(var i = 1; i < 5; i ++){
//     for(var j = 1; j < 5; j ++){
//         for(var k = 1; k < 5; k ++){
//             if(i != j && j != k && k != i){
//                 sum+=1;
//                 console.log("1、2、3、4个数字能组成的三位数有" + i + j + k );
//             }
//         }
//     }
// }
// console.log('有'+sum+'个');


// 9.输入某年，某月，某日，判断这一天是一年中的第几天？
