// 1. 写一个函数，实现对任意数组的排序，var arr = [18, 45, 0, 58, 32,59]
// function a(arr) {
//     arr.sort(function (a, b) { return a - b })
//     return arr
// }
// var arr = [18, 45, 0, 58, 32, 59]
// console.log(a(arr));


// 2. 写一个函数，求任意数组的元素的和，var arr =
// function a(arr) {
//     var sum = 0;
//     for (var i = 0; i < arr.length; i++) {
//         sum += arr[i]
//     }
//     return sum
// }
// var arr = [18, 45, 333, 5, 6, 1, 5]
// console.log(a(arr))


// 3. 写一个函数，求出3在数组 var arr = {3,4,3,5,7,9};中出现的次数
// 声明函数 声明一个计数变量 循环遍历 判断 arr[i]==3 sum++ 输出 sum
// function a(arr){
//     var sum=0
//     for(var i=0;i<arr.length;i++){
//         if(arr[i]==3){
//             sum++
//         }
//     }
//     return sum
// }
// var arr=[3,4,3,5,7,9]
// console.log(a(arr))

// 6. 写一个函数，判断是否是闰年【能被4整除且不能被100整除，或者能被400整除】
// 声明函数 循环遍历 if判断是否是闰年
// function a() {
//     for (var i = 2000; i <= 4000; i++) {
//         if (i % 4 == 0 && i % 100 != 0 || i % 400 == 0){
//             console.log(i+'是')
//         }else{
//             console.log(i+'否')
//         }
//     }
// }
// a()

// 7. 写一个函数,  求圆的面积：PI *r *r，圆的周长
// 声明函数 
// function a(){
//     var pai=3.14

// }
// var r=0;







// // 8. 写一个函数,  100到200有多少3 ，解释：例如101中没有3；103中有一个3；133中有两个3。你要做的是统计出到200之间的整数一共有多少个3。
// // 声明函数 循环遍历 声明一个计数变量 判断ge shi  位出现三出现3的次数 +1 
// var sum = 0;
// function a(sum) {
//     for (var i = 100; i <= 200; i++) {
//         var ge = i % 10
//         var shi = (i - ge) / 10 % 10
//         var bai = (i - ge - shi * 10) / 100
//         if (ge == 3) {
//             sum++
//         }
//         if (shi == 3) {
//             sum++
//         }
//         if (bai == 3) {
//             sum++
//         }
//     }
//     return sum

// }
// console.log(a(sum))


// 9. 写一个函数，该函数用于计算一个正数的因子和（比如6的因子和是1+2+3+6=12）


// 10. 写一个函数，求斐波那契数列fibonacci中的第n个数是多少？？1  1  2  3  5   8  13  21 
// 11.写一个函数，求任意一个数的阶乘
// function a(n){
    
//     var sum=0
//     for(var i=1;i<=n;i++){
//         sum+=i
//     }
//     return sum
// }
// var n=3
// console.log(a(n))


// 13.写一个函数,求数组中的最大值,  var arr = [18, 45, 0, 58, 32,59]
// 14.写一个函数,去掉数组中重复的元素，var arr = [1,5,4,4,7,6,6]
// 声明函数 声明数组 定义一个新数组 循环遍历 判断下标为-1，添加到新数组
var arr = [18, 45, 0, 58, 32,59]










// 15.写一个函数，求100 - 200 之间所有数的和
// 声明函数 声明一个变量和 循环遍历 相加
// function a(){
//     var sum=0;
//     for(var i=100;i<=200;i++){
//         sum+=i
//     }
//     console.log(sum)
// }
// a()


// 16.写一个函数, 实现字符串反转,输入：["h","e","l","l","o"],输出：["o","l","l","e","h"]
// 17.写一个函数，实现无论用户传入几个数字，都可以求和，例如，console.log(add(1,2,3)); //6   console.log(add(1,2,3,4,5,6)); //21
// 18.给定一个整数，写一个函数来判断它是否是 3 的幂次方
// 19.给定两个数组，编写一个函数来计算它们的交集。
// 20.写一个函数，打印九九乘法表

// 21.写一个函数，实现n的阶层的和求1+2!+3!+...+n!的和

// for(var i=0;i<n;i++){


// }
// 22.写一个函数， 传入3 个正数，判断能否构成一个三角形
