// 5.写一个函数,输入某年某月某日，判断这一天是一年中的第几天

// 分析:
// 1.2019,10,24 
// 2. 第一种情况: 小于2月(不包括2月 只算一月)   2019 1 31   31  1-1 1-31 
// 3. 第二种情况:  大于2月  2019 5  23   是一月的天数 +2月的天数(28) +1
// 4. 第三种情况:  闰年还是平年  2008  2009  2月+1  


// 步骤
// 1.创建一个函数 getDays() 参数 年 月 日
function getDays(year, month, day) {
        // 2.创建一个变量 用来存储计算得到是一年中的第几天
        let days = day;
        // 3.判断是不是小于2月
        if (month < 2) {
            // 3.1 如果小于2月 直接返回日的天数
            return days;
        }
        // 4.声明一个数组 存储一年中 12个月每个月的天数
        let months = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
        // 5.for循环遍历 减去月份-1次
        for (let i = 0; i < month - 1; i++) {
            // 6.让每次遍历的数据和已经存储的数据累加
            days += months[i];
        }
        // 7.判断是不是闰年且月份大于2月
        if ((year % 4 === 0 && year % 100 !== 0 || year % 400 === 0) && month > 2) {
            days++;
        }
        // 8.把结果输出
        return days;
    }
    
    // 测试
    console.log(getDays(2008, 3, 1));